#+title: A Brief Tutorial for emacs-lisp

** Sample
   #+begin_src emacs-lisp
   (progn
     (fset 'sayHello (lambda () (message "Hello World !")))
     (symbol-function 'sayHello)
     (sayHello))
     #+end_src

     #+RESULTS:
     : Hello World !

